sdaiGetAggrByIndex(Sdai_Id_aggr*,System.UInt32,SdaiPrimitiveType,System.Void*)
\details
Retrieves an aggregate value by its index.
\param aggregate [in] An aggregate to retrieves the value from.
\param index     [in] An index of the required value.
\param valueType [in] A data type of the required value.
\param value     [out] A placeholder that contains the aggregate value.
\returns A raw pointer to the required aggregate value.